-- phpMyAdmin SQL Dump
-- version 5.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 11, 2020 at 11:15 AM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.4.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `chamix`
--

-- --------------------------------------------------------

--
-- Table structure for table `tbl_prd`
--

CREATE TABLE `tbl_prd` (
  `p_id` int(11) NOT NULL,
  `ref_em_id` int(100) NOT NULL COMMENT 'รหัสคนเพิ่มข้อมูล',
  `type_id` int(100) NOT NULL COMMENT 'รหัสประเภทสินค้า',
  `name` varchar(100) CHARACTER SET utf8 NOT NULL,
  `detail` text CHARACTER SET utf8 NOT NULL,
  `price` float(10,2) NOT NULL,
  `images` varchar(100) CHARACTER SET utf8 NOT NULL,
  `view` varchar(100) NOT NULL,
  `datesave` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

--
-- Dumping data for table `tbl_prd`
--

INSERT INTO `tbl_prd` (`p_id`, `ref_em_id`, `type_id`, `name`, `detail`, `price`, `images`, `view`, `datesave`) VALUES
(50, 0, 8, 'โกโก้ช็อค', 'โกโก้จัดเต็มพร้อมช็อคโกแลตแน่นๆ', 25.00, '10514574020200529_190959.jpg', '', '2020-05-29 12:10:00'),
(49, 0, 6, 'แดงโซดามะนาว', 'เฮลบลูบอยแดงผสมมะนาวและโซดาเพื่อความสดชื่น!', 25.00, '128613329620200529_190914.jpg', '', '2020-05-29 12:09:15'),
(48, 0, 7, 'เอสเปรสโซ', 'กาแฟดำคั่ว หอม อร่อย!', 25.00, '126675134720200529_190615.jpg', '', '2020-05-29 12:06:15'),
(51, 0, 8, 'ไมโลมิกซ์', 'ไมโลสูตรเด็ดจากชามิกซ์!\r\nอร่อยหวานมัน', 25.00, '73980364320200529_191047.jpg', '', '2020-05-29 12:10:48'),
(52, 0, 5, 'ชาเขียว', 'ชาเขียวคุณภาพ อร่อย หวาน มัน', 25.00, '11449761220200529_191123.jpg', '', '2020-05-29 12:11:24'),
(53, 0, 5, 'ชาเย็น', 'ชาเย็นหอมหวานมัน เหมาะกับอากาศร้อนๆ', 25.00, '214377999220200529_191155.jpg', '', '2020-05-29 12:11:56'),
(54, 0, 5, 'ชาดำเย็น', 'ชาดำเย็น อร่อยเข้ม ลงตัว ', 25.00, '67702870420200529_191217.jpg', '', '2020-05-29 12:12:18'),
(55, 0, 5, 'ชานมเย็น', 'นมข้นหวานผสมกับน้ำแดงอร่อยๆพร้อมน้ำแข็งเย็นๆสดชื่น', 25.00, '131960450020200529_191303.jpg', '', '2020-05-29 12:13:04'),
(56, 0, 5, 'ชานมไข่มุกไต้หวัน', 'ใบชาส่งตรงจากไต้หวัน อร่อยไม่แพ้เมนูอื่นแน่นอน', 25.00, '56603888920200529_191358.jpg', '', '2020-05-29 12:13:59'),
(57, 0, 8, 'นมเผือกมิกซ์', 'นมเผือกสูตรพิเศษจากชามิกซ์ ใครไม่ชอบกินเผือก แนะนำลองเมนูนี้ แล้วจะเปลี่ยนใจ', 25.00, '152767770920200529_191452.jpg', '', '2020-05-29 12:14:52'),
(58, 0, 7, 'นมสดไซโคลน', 'ไม่ใช่แค่ลวดลายที่สวยอย่างเดียว แต่รสชาติอร่อยกว่าลวดลาย!', 25.00, '175323428320200529_191541.jpg', '', '2020-05-29 12:15:41'),
(59, 0, 7, 'นมสดไซโคลนวนิลา', 'อร่อยชื้นใจแถมได้แก้วลายชิคๆไปถ่ายรูปกันสวยๆ', 25.00, '205930488820200529_191631.jpg', '', '2020-05-29 12:16:31'),
(60, 0, 7, 'นมสดไซโคลนสตรอวเบอรี่', 'นมสดที่มีไซโคลนรสสตรอวเบอรี่วาดลวดลายสีแดงประกาย อร่อย เปรี้ยว หวาน ลงตัว', 25.00, '76453297920200529_191827.jpg', '', '2020-05-29 12:18:27'),
(61, 0, 8, 'นมสดวนิลา', 'นมสดผสมกับวนิลาให้รสชาติที่ลงตัวและละมุนสุดๆ', 25.00, '143169865720200529_191901.jpg', '', '2020-05-29 12:19:02'),
(62, 0, 8, 'นมสดบราวชูก้า', 'นมสดผสมบราวชูก้าเป็นอะไรที่ลงตัวที่สุดแล้ว ถ้าอยากรู้ว่าเป็นอย่างไร ลองสั่งมาดูแล้วจะติดใจ!', 25.00, '2386974720200529_191949.jpg', '', '2020-05-29 12:19:50'),
(63, 0, 8, 'นมสดบานาน่า', 'นมสดกับกล้วยความอร่อยที่เกินจะบรรยาย ต้องลอง', 25.00, '98252542320200529_192023.jpg', '', '2020-05-29 12:20:24'),
(64, 0, 8, 'นมสดมิกซ์', 'นมสดสูตรพิเศษจากชามิกซ์ อร่อยนุ่มๆมาก', 25.00, '56724702420200529_192105.jpg', '', '2020-05-29 12:21:05'),
(65, 0, 6, 'บลูฮาวาย', 'เปรี้ยว หวาน สดชื่น เหมาะกับหน้าร้อนที่ต้องหาของเย็นๆ แนะนำบลูฮาวาย', 25.00, '59056355620200529_192206.jpg', '', '2020-05-29 12:22:06'),
(66, 0, 6, 'พายลิ้นจี่โซดา', 'อาจฟังดูแปลกๆ แต่รสชาติรับประกันได้ว่าอร่อยมาก สดชื่นมาก', 25.00, '101263489220200529_192304.jpg', '', '2020-05-29 12:23:04'),
(67, 0, 6, 'พายสตรอวเบอรี่โซดา', 'ความเปรี้ยว หวาน ซ่า ที่ลงตัว หน้าร้อนไม่มีใครลองหันมามองเมนูนี้นะ แล้วจะติดใจ', 25.00, '5241402020200529_192352.jpg', '', '2020-05-29 12:23:52'),
(68, 0, 7, 'มัคคิอาโต้', 'กาแฟเข้มๆ นมสดหนักๆ อร่อยฟินๆ ต้องลอง', 35.00, '125989680320200529_192425.jpg', '', '2020-05-29 12:24:26');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tbl_prd`
--
ALTER TABLE `tbl_prd`
  ADD PRIMARY KEY (`p_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tbl_prd`
--
ALTER TABLE `tbl_prd`
  MODIFY `p_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
